app/controllers/buddies_controller.rb

SELECT "buddies".* FROM "buddies"
---
  def index
    @buddies = Buddy.all