app/controllers/groups_controller.rb

  def create
    @group = Group.new(group_params)

    if @group.save
---
INSERT INTO "groups" ("name", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "example"], ["text", "example text"], ["created_at", "2019-11-03 21:04:46.120221"], ["updated_at", "2019-11-03 21:04:46.120221"]]